YCSB-master/resultadosAtual/rocksdb-WorkloadA-4000.log
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:rocksdb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/conf:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/target/rocksdb-binding-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/jose/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/jose/.m2/repository/org/rocksdb/rocksdbjni/5.11.3/rocksdbjni-5.11.3.jar:/home/jose/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/core/target/core-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -P workloads/workloada -p operationcount=4000 -p rocksdb.dir=./dbR/ycsb-rocksdb-dataV2 -s -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -P workloads/workloada -p operationcount=4000 -p rocksdb.dir=./dbR/ycsb-rocksdb-dataV2 -s -t
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2019-06-22 19:32:00:207 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2019-06-22 19:32:00:509 0 sec: 4000 operations; 12422,36 current ops/sec; [READ: Count=1981, Max=3203, Min=2, Avg=15,16, 90=30, 99=78, 99.9=115, 99.99=3203] [CLEANUP: Count=1, Max=31439, Min=31424, Avg=31432, 90=31439, 99=31439, 99.9=31439, 99.99=31439] [UPDATE: Count=2019, Max=1444, Min=16, Avg=48,94, 90=82, 99=222, 99.9=325, 99.99=1444] 
[OVERALL], RunTime(ms), 322
[OVERALL], Throughput(ops/sec), 12422.360248447205
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6211180124223602
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 2
[TOTAL_GC_TIME_%], Time(%), 0.6211180124223602
[READ], Operations, 1981
[READ], AverageLatency(us), 15.163553760726906
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 3203
[READ], 95thPercentileLatency(us), 45
[READ], 99thPercentileLatency(us), 78
[READ], Return=OK, 1981
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 31432.0
[CLEANUP], MinLatency(us), 31424
[CLEANUP], MaxLatency(us), 31439
[CLEANUP], 95thPercentileLatency(us), 31439
[CLEANUP], 99thPercentileLatency(us), 31439
[UPDATE], Operations, 2019
[UPDATE], AverageLatency(us), 48.94254581475978
[UPDATE], MinLatency(us), 16
[UPDATE], MaxLatency(us), 1444
[UPDATE], 95thPercentileLatency(us), 113
[UPDATE], 99thPercentileLatency(us), 222
[UPDATE], Return=OK, 2019
rocksdb-binding
CENAS
['java', '-cp', '/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/conf:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/target/rocksdb-binding-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/jose/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/jose/.m2/repository/org/rocksdb/rocksdbjni/5.11.3/rocksdbjni-5.11.3.jar:/home/jose/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/core/target/core-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar', 'com.yahoo.ycsb.Client', '-db', 'com.yahoo.ycsb.db.rocksdb.RocksDBClient', '-P', 'workloads/workloada', '-p', 'operationcount=4000', '-p', 'rocksdb.dir=./dbR/ycsb-rocksdb-dataV2', '-s']
FIM